#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.rds.aws_key_pair.mmm2: Refreshing state... [id=mmm2]
module.rds.aws_rds_cluster_parameter_group.this: Refreshing state... [id=line-bot-sample2-rds-mysql]
module.rds.aws_ssm_parameter.database_password_secret: Refreshing state... [id=MYSQL_PASSWORD]
module.rds.aws_security_group.example: Refreshing state... [id=sg-0c02a939a5b549571]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.ecr-app.aws_ecr_repository.main: Refreshing state... [id=line-bot-sample2-app]
module.ecr-app.aws_ecr_repository.app2: Refreshing state... [id=line-bot-sample2-app2]
module.ecs.aws_cloudwatch_log_group.line-bot-sample2: Refreshing state... [id=/aws/ecs/line-bot-sample2]
module.route53.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/06e7b54e-fc23-4c2b-8939-aabde5bbb683]
module.ecs.aws_cloudwatch_log_group.python2: Refreshing state... [id=/aws/ecs/line-bot-sample2/python2]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/line-bot-sample2]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=EcsTaskRole-line-bot-sample2]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_for_ecr: Refreshing state... [id=EcsTaskRole-line-bot-sample2-20210429021106029600000001]
module.ecs.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=EcsTaskRole-line-bot-sample2:cloudwatch_logs]
module.rds.aws_iam_role_policy.mysql_db_password_policy_secretsmanager: Refreshing state... [id=EcsTaskRole-line-bot-sample2:password-policy-mysql_db_password_policy_secretsmanager]
module.route53.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.route53.aws_acm_certificate_validation.main: Refreshing state... [id=2021-04-27 09:08:01 +0000 UTC]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0829c8222f3c2e3f0]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0db9d7fef1d452a9f]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-071a11b51c485b0b1]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-03c288199d18a8e45]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0d00944d99dfe3fb9]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0833e5cbb3feed7c4]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0bb63a2f82ac5687b]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-071dd337cfbbbb50d]
module.ecr-app.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05f06bcd8be5135ea]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-0a3c585bbf6bba58b]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-0b7249501f7f39f80]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0f70a7f400318b4fa]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-02c271aaae088ea4b]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0a31ed301afa10c9e]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/line-bot-sample2-target-group/85c2e8b8911549f7]
module.rds.aws_security_group.ec2_private: Refreshing state... [id=sg-0698e38f38bcf8699]
module.rds.aws_security_group.ec2_private_nat_to_global: Refreshing state... [id=sg-01953abc140cbf846]
module.rds.aws_security_group.vpc_endpoint_rds2: Refreshing state... [id=sg-09b2b69c0a3d047b7]
module.rds.aws_security_group.mysql_to_private: Refreshing state... [id=sg-0998f42e9dff1142f]
module.rds.aws_security_group.rds: Refreshing state... [id=sg-0c5cbbd9768364569]
module.rds.aws_security_group.vpc_endpoint_rds: Refreshing state... [id=sg-0ce678efdd64b44e5]
module.rds.aws_security_group.ec2_public_bastian: Refreshing state... [id=sg-09c4e132b042330b1]
module.ecr-app.aws_security_group.vpc_endpoint: Refreshing state... [id=sg-096192166d6f9cd8b]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0833e5cbb3feed7c41080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05e859eb1301e09d1]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dfdb12fab7d4006a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f51279304586a58e]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/2d23d36ec59ecb9b]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0a74d87da37cd4c32]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0c7b9baba708642b6]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-0840d58339cd83f90]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[1]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea46037175]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[2]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea2941716146]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[0]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea3530383921]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=line-bot-sample2-rds-mysql]
module.rds.aws_network_interface.private_interface_debug: Refreshing state... [id=eni-047a9f53ad5e07379]
module.rds.aws_network_interface.public_interface_debug: Refreshing state... [id=eni-0adf550e3c3fecffd]
module.rds.aws_vpc_endpoint.rds: Refreshing state... [id=vpce-08152a4039ea057bd]
module.ecr-app.aws_vpc_endpoint.ssm: Refreshing state... [id=vpce-0685661311e6eb46b]
module.ecr-app.aws_vpc_endpoint.cloudwatch_logs: Refreshing state... [id=vpce-0d26e22adef0a927d]
module.ecr-app.aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-0aada49a067e44d0b]
module.ecr-app.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-0aa2aa645cd78c54a]
module.ecr-app.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-060745b09df69e96a]
module.rds.aws_instance.private: Refreshing state... [id=i-0ba1a78d120bb2595]
module.rds.aws_instance.public: Refreshing state... [id=i-05523e33b694d615e]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/cb9619fbb54169cb]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261]
module.rds.aws_rds_cluster.this: Refreshing state... [id=line-bot-sample2-rds-mysql]
module.route53.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_line-bot-sample2.moikilo00.net_A]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261/d135b6a132b7b048]
module.rds.aws_rds_cluster_instance.this: Refreshing state... [id=line-bot-sample2-rds-mysql]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=line-bot-sample2-task-definition]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2]
module.rds.aws_eip.public_eip: Refreshing state... [id=eipalloc-0e99b9f6ec0a60549]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.template_file.container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "container_definitions"  {
      ~ id       = "c727abe8e81079db3cec8ffebdeccc971475c9439cdfc1cf198933bc6d870f48" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "DB_DATABASE"
                          - value = "linebotsample2database"
                        },
                      - {
                          - name  = "USER"
                          - value = "user"
                        },
                      - {
                          - name  = "ENDPOINT"
                          - value = "line-bot-sample2-rds-mysql.cluster-cdx787qeoakd.ap-northeast-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "PORT"
                          - value = "3306"
                        },
                      - {
                          - name  = "CONTAINER_TAG"
                          - value = "0.0.1-624f3c7"
                        },
                    ]
                  - image            = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/sample-python2:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/line-bot-sample2/python2"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - name             = "line-bot-sample2-app"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "PASS"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/MYSQL_PASSWORD"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        {
                            name  = "DB_DATABASE"
                            value = "${mysql_database}"
                        },
                      ~ {
                          ~ name  = "USER" -> "DB_USER"
                            # (1 unchanged element hidden)
                        },
                      ~ {
                          ~ name  = "ENDPOINT" -> "DB_ADDRESS"
                            # (1 unchanged element hidden)
                        },
                      ~ {
                          ~ name  = "PORT" -> "DB_PORT"
                            # (1 unchanged element hidden)
                        },
                        {
                            name  = "CONTAINER_TAG"
                            value = "${container_tag}"
                        },
                    ]
                  ~ image            = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/sample-python2:latest" -> "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/line-bot-sample2-app2:0.0.1-44327f5"
                  ~ secrets          = [
                      ~ {
                          ~ name      = "PASS" -> "DB_PASSWORD"
                            # (1 unchanged element hidden)
                        },
                    ]
                    # (3 unchanged elements hidden)
                },
            ]
        )
      ~ vars     = {
          ~ "log_group"            = "/aws/ecs/line-bot-sample2/python2" -> "/aws/ecs/line-bot-sample2/app2"
            # (8 unchanged elements hidden)
        }
    }

  # module.ecs.aws_cloudwatch_log_group.app2 will be created
  + resource "aws_cloudwatch_log_group" "app2" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/line-bot-sample2/app2"
      + retention_in_days = 0
      + tags              = {
          + "Name" = "linebot2-app2"
        }
      + tags_all          = {
          + "Name" = "linebot2-app2"
        }
    }

  # module.ecs.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2"
        name                               = "line-bot-sample2"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/line-bot-sample2-task-definition:36" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/line-bot-sample2-task-definition:36" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "CONTAINER_TAG"
                          - value = "0.0.1-624f3c7"
                        },
                      - {
                          - name  = "DB_DATABASE"
                          - value = "linebotsample2database"
                        },
                      - {
                          - name  = "ENDPOINT"
                          - value = "line-bot-sample2-rds-mysql.cluster-cdx787qeoakd.ap-northeast-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "PORT"
                          - value = "3306"
                        },
                      - {
                          - name  = "USER"
                          - value = "user"
                        },
                    ]
                  - essential        = true
                  - image            = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/sample-python2:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/line-bot-sample2/python2"
                          - awslogs-region        = "ap-northeast-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "line-bot-sample2-app"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "PASS"
                          - valueFrom = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/MYSQL_PASSWORD"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "line-bot-sample2-task-definition" -> (known after apply)
      ~ revision                 = 36 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.rds.aws_network_interface.public_interface_debug will be updated in-place
  ~ resource "aws_network_interface" "public_interface_debug" {
        id                 = "eni-0adf550e3c3fecffd"
      ~ security_groups    = [
          - "sg-0c02a939a5b549571",
            # (1 unchanged element hidden)
        ]
        tags               = {
            "Name" = "public_debug_network_interface"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_security_group.example will be destroyed
  - resource "aws_security_group" "example" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:554506578892:security-group/sg-0c02a939a5b549571" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0c02a939a5b549571" -> null
      - ingress                = [] -> null
      - name                   = "example" -> null
      - owner_id               = "554506578892" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "example"
        } -> null
      - tags_all               = {
          - "Name" = "example"
        } -> null
      - vpc_id                 = "vpc-0b9c9dcab97f3491c" -> null
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*